import random

# Для натурального числа К напечатать фразу "мы нашли К грибов в лесу", согласовав окончание слова "гриб" с числом К

K = random.randint(1, 30)
if K == 1:
    a = "гриб"
    print('мы нашли', K, a)
elif K < 5:
    a = "гриба"
    print('мы нашли', K, a)
elif K < 21:
    a = "грибов"
    print('мы нашли', K, a)
elif K == 21:
    a = "гриб"
    print('мы нашли', K, a)
elif K < 24:
    a = "гриба"
    print('мы нашли', K, a)
elif K <= 30:
    a = "грибов"
    print('мы нашли', K, a)
else:
    print()